CSI API ETABS v1
cAreaObj.GetOffsets3 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOffsets3(
	string Name,
	ref int NumberPoints,
	ref double[] Offsets
)
Function GetOffsets3 (
	Name As String,
	ByRef NumberPoints As Integer,
	ByRef Offsets As Double()
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumberPoints As Integer
Dim Offsets As Double()
Dim returnValue As Integer
returnValue = instance.GetOffsets3(Name,
	NumberPoints, Offsets)
int GetOffsets3(
	String^ Name,
	int% NumberPoints,
	array<double>^% Offsets
)
abstract GetOffsets3 :
        Name : string *
        NumberPoints : int byref *
        Offsets : float[] byref -> int
Parameters
Name
Type: System.String
NumberPoints
Type: System.Int32
Offsets
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace